# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 3  # number of classes
depth_multiple: 1.0 # model depth multiple
width_multiple: 1.0  # layer channel multiple
anchors:
  - [4,5, 8,10, 22,18] # P2/4
  - [10,13, 16,30, 33,23]  # P3/8

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, C3, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 6, C3, [256]],
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
   [-1, 9, CSB, [512]],
   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32
   [-1, 3, CSB, [1024]],
   [-1, 1, SPPF, [1024, 5]],  # 9
  ]

# YOLOv5 v6.0 head
head:
  #第一层第一个F
  [[-1, 1, Conv, [512, 1, 1]], # 11
   [6, 1, Conv, [512, 3, 2]],
   [[-1, 10], 1, Concat, [1]],
   [-1, 3, MRF, [512]], # 14
  #第二层第一个F
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], #15
   [4, 1, Conv, [256, 3, 2]], # 16
   [[14, -1, 6], 1, Concat, [1]],
   [-1, 3, MRF, [512]], # 18
  #第三层第一个F
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], #19
   [2, 1, Conv, [128, 3, 2]], # 20
   [[4,18, 19], 1, Concat, [1]],
   [-1, 3, MRF, [256]], # 22
  #第四层的第一个F
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 2], 1, Concat, [1]],
   [-1,3, MRF,[128]],  # 25
  #第三层第二个F
   [ -1, 1, Conv,[ 128,3,2 ] ],
   [[-1,21],1,Concat,[1]],
   [-1,3,MRF,[256]],  # 28



   [[24,27], 1, Decoupled_Detect, [nc, anchors]],  # Detect(P2,P3, P4, P5)
  ]